tests/download-simulation-existing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Property to Variable Init" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.io.File

vars.put(&quot;hostname&quot;, System.getProperty(&quot;hostname&quot;))
vars.put(&quot;port&quot;, System.getProperty(&quot;port&quot;))
vars.put(&quot;inputDir&quot;, System.getProperty(&quot;inputDir&quot;))
vars.put(&quot;downloadDir&quot;, System.getProperty(&quot;downloadDir&quot;))

new File( vars.get(&quot;downloadDir&quot;) ).mkdirs()
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">prev.setIgnore();</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${hostname}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">0</stringProp>
          <stringProp name="RandomTimer.range">100.0</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Build Setup" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.io.File
import groovy.json.JsonSlurper

def buildNumber = 7
vars.put( &quot;repoCounter&quot;, buildNumber.toString());

new File(vars.get(&quot;downloadDir&quot;), vars.get(&quot;repoCounter&quot;)).mkdirs()

def inputDir = System.getProperty(&quot;inputDir&quot;)

def counter=1
def build = new JsonSlurper().parse(new File(&quot;${inputDir}/build-data/build-${buildNumber}.json&quot;))

build.downloads.each{path-&gt;
  vars.put(&quot;download_${counter}&quot;, path)
  counter++
}</stringProp>
        </JSR223Sampler>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">prev.setIgnore();</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="add build group" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;type&quot; : &quot;group&quot;,&#xd;
  &quot;key&quot; : &quot;maven:group:test-${repoCounter}&quot;,&#xd;
  &quot;disabled&quot; : false,&#xd;
  &quot;doctype&quot; : &quot;group&quot;,&#xd;
  &quot;name&quot; : &quot;test-${repoCounter}&quot;,&#xd;
  &quot;constituents&quot;:[&#xd;
    &quot;group:public&quot;&#xd;
  ]&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/admin/stores/maven/group</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">201</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ForeachController guiclass="ForeachControlPanel" testclass="ForeachController" testname="Download files" enabled="true">
          <stringProp name="ForeachController.inputVal">download</stringProp>
          <stringProp name="ForeachController.returnVal">path</stringProp>
          <boolProp name="ForeachController.useSeparator">true</boolProp>
        </ForeachController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Download to cache" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/folo/track/test-${repoCounter}/group/test-${repoCounter}/${path}</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResultSaver guiclass="ResultSaverGui" testclass="ResultSaver" testname="Save Responses to a file" enabled="false">
              <stringProp name="FileSaver.filename">${downloadDir}/${path}</stringProp>
              <boolProp name="FileSaver.errorsonly">false</boolProp>
              <boolProp name="FileSaver.skipautonumber">true</boolProp>
              <boolProp name="FileSaver.skipsuffix">true</boolProp>
              <boolProp name="FileSaver.successonly">false</boolProp>
            </ResultSaver>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops, )}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(builders, )}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Property to Variable Init" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.io.File

vars.put(&quot;hostname&quot;, System.getProperty(&quot;hostname&quot;))
vars.put(&quot;port&quot;, System.getProperty(&quot;port&quot;))
vars.put(&quot;inputDir&quot;, System.getProperty(&quot;inputDir&quot;))
vars.put(&quot;downloadDir&quot;, System.getProperty(&quot;downloadDir&quot;))
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">prev.setIgnore();</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${hostname}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Uniform Random Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">0</stringProp>
          <stringProp name="RandomTimer.range">100.0</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Download from Cache" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.io.File
import groovy.json.JsonSlurper

def buildNumber = 7
vars.put(&quot;repoCounter&quot;, buildNumber.toString())

def inputDir = System.getProperty(&quot;inputDir&quot;)

def counter=1
def build = new JsonSlurper().parse(new File(&quot;${inputDir}/build-data/build-${buildNumber}.json&quot;))

build.downloads.each{path-&gt;
  vars.put(&quot;download_${counter}&quot;, path)
  counter++
}</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <ForeachController guiclass="ForeachControlPanel" testclass="ForeachController" testname="Download files" enabled="true">
          <stringProp name="ForeachController.inputVal">download</stringProp>
          <stringProp name="ForeachController.returnVal">path</stringProp>
          <boolProp name="ForeachController.useSeparator">true</boolProp>
        </ForeachController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Download artifact from cache" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/api/folo/track/test-${repoCounter}/group/test-${repoCounter}/${path}</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
            <com.github.johrstrom.listener.PrometheusListener guiclass="com.github.johrstrom.listener.gui.PrometheusListenerGui" testclass="com.github.johrstrom.listener.PrometheusListener" testname="Prometheus Listener" enabled="true">
              <collectionProp name="prometheus.collector_definitions">
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_rt_hist</stringProp>
                  <stringProp name="collector.type">HISTOGRAM</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="collector.quantiles_or_buckets">100,500,1000,3000</stringProp>
                  <stringProp name="listener.collector.measuring">ResponseTime</stringProp>
                </elementProp>
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_rt_summary</stringProp>
                  <stringProp name="collector.type">SUMMARY</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="collector.quantiles_or_buckets">0.75,0.5|0.95,0.1|0.99,0.01</stringProp>
                  <stringProp name="listener.collector.measuring">ResponseTime</stringProp>
                </elementProp>
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_success_total</stringProp>
                  <stringProp name="collector.type">COUNTER</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="listener.collector.measuring">SuccessTotal</stringProp>
                </elementProp>
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_response_success_ratio</stringProp>
                  <stringProp name="collector.type">SUCCESS_RATIO</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="listener.collector.measuring">SuccessRatio</stringProp>
                </elementProp>
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_latency</stringProp>
                  <stringProp name="collector.type">HISTOGRAM</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="collector.quantiles_or_buckets">100,500,1000,3000</stringProp>
                  <stringProp name="listener.collector.measuring">Latency</stringProp>
                </elementProp>
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_count_total</stringProp>
                  <stringProp name="collector.type">COUNTER</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="listener.collector.measuring">CountTotal</stringProp>
                </elementProp>
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_response_size</stringProp>
                  <stringProp name="collector.type">HISTOGRAM</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="collector.quantiles_or_buckets">100,500,1000,3000</stringProp>
                  <stringProp name="listener.collector.measuring">ResponseSize</stringProp>
                </elementProp>
                <elementProp name="" elementType="com.github.johrstrom.listener.ListenerCollectorConfig">
                  <stringProp name="collector.help">default help string</stringProp>
                  <stringProp name="collector.metric_name">indy_dl_idle_time</stringProp>
                  <stringProp name="collector.type">SUMMARY</stringProp>
                  <collectionProp name="collector.labels">
                    <stringProp name="102727412">label</stringProp>
                  </collectionProp>
                  <stringProp name="collector.quantiles_or_buckets">0.75,0.5|0.95,0.1|0.99,0.01</stringProp>
                  <stringProp name="listener.collector.measuring">IdleTime</stringProp>
                </elementProp>
              </collectionProp>
            </com.github.johrstrom.listener.PrometheusListener>
            <hashTree/>
            <ResultSaver guiclass="ResultSaverGui" testclass="ResultSaver" testname="Save Responses to a file" enabled="false">
              <stringProp name="FileSaver.filename">${downloadDir}/${path}</stringProp>
              <boolProp name="FileSaver.errorsonly">false</boolProp>
              <boolProp name="FileSaver.skipautonumber">true</boolProp>
              <boolProp name="FileSaver.skipsuffix">true</boolProp>
              <boolProp name="FileSaver.successonly">false</boolProp>
            </ResultSaver>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${inputDir}/../aggregate-report.log</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="tearDown Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Property to Variable Init" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">import java.io.File

vars.put(&quot;hostname&quot;, System.getProperty(&quot;hostname&quot;))
vars.put(&quot;port&quot;, System.getProperty(&quot;port&quot;))
</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="JSR223 PostProcessor" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">prev.setIgnore();</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${hostname}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Clean up group" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">/api/admin/stores/maven/group/test-7</stringProp>
          <stringProp name="HTTPSampler.method">DELETE</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>